Create Method
 Creates a new LinePatternElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static LinePatternElement Create(
	Document document,
	LinePattern linePattern
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	linePattern As LinePattern _
) As LinePatternElement
Visual C++
public:
static LinePatternElement^ Create(
	Document^ document,
	LinePattern^ linePattern
)
Parameters
document
Type: Autodesk.Revit.DBDocument
 The document in which to create the LinePatternElement.
linePattern
Type: Autodesk.Revit.DBLinePattern
 The LinePattern associated to the newly created LinePatternElement.
Return Value
 The newly created LinePatternElement.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  The Line Pattern is not valid.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
LinePatternElement Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →